title: IAM Policy Escalation
logsource:
  product: cloud
  service: iam
detection:
  selection:
    event_type:
      - AttachUserPolicy
      - PutUserPolicy
      - PutRolePolicy
      - AttachRolePolicy
  condition: selection
falsepositives:
  - Authorized IAM policy updates by administrators
level: high
tags:
  - attack.t1078.004
  - attack.privilege_escalation
