title: Key Vault Secrets Read
logsource:
  product: cloud
  service: identity
detection:
  selection:
    event_type: Microsoft.KeyVault/vaults/secrets/read
  condition: selection
falsepositives:
  - Application reading secrets from Key Vault
level: medium
tags:
  - attack.t1555
  - attack.credential_access
