title: Secrets Manager Access
logsource:
  product: cloud
  service: iam
detection:
  selection:
    event_type: GetSecretValue
  condition: selection
falsepositives:
  - Automated service retrieving managed secrets
level: medium
tags:
  - attack.t1555
  - attack.credential_access
